## Importing libs

In [40]:
import numpy as np 
import pandas as pd

## Loading the Dataset

In [41]:
data = pd.read_csv("Titanic.csv")

### Checking head and tail to confirm data is loaded successfully or not

In [82]:
data.head(2)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C

In [83]:
data.tail(2)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.00,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.75,NaN,Q

## checking size and data types

In [44]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

#
## extracting statistics of data

In [45]:
data.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

###
## checking duplicate records

In [81]:
data.duplicated().sum()

np.int64(0)

###
## Checking Unique

In [48]:
### no of unique values
data.nunique()

PassengerId    891
Survived         2
Pclass           3
Name           891
Sex              2
Age             88
SibSp            7
Parch            7
Ticket         681
Fare           248
Cabin          147
Embarked         3
dtype: int64

In [49]:
### unique values of column 
print(data["Embarked"].unique())
data.Sex.unique()

['S' 'C' 'Q' nan]

array(['male', 'female'], dtype=object)

###
## Value counts in each unique cat.

In [50]:
print(data["Pclass"].value_counts())
round(data.Pclass.value_counts()*100/len(data),2)

Pclass
3    491
1    216
2    184
Name: count, dtype: int64

Pclass
3    55.11
1    24.24
2    20.65
Name: count, dtype: float64

In [51]:
print(data.Sex.value_counts())
round(data.Sex.value_counts()*100/len(data),2)

Sex
male      577
female    314
Name: count, dtype: int64

Sex
male      64.76
female    35.24
Name: count, dtype: float64


###
## Checking Null values

In [84]:
data.isnull()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,False,False,False,False,False,False,False,False,False,False,True,False
1,False,False,False,False,False,False,False,False,False,False,False,False
2,False,False,False,False,False,False,False,False,False,False,True,False
3,False,False,False,False,False,False,False,False,False,False,False,False
4,False,False,False,False,False,False,False,False,False,False,True,False
...,...,...,...,...,...,...,...,...,...,...,...,...
886,False,False,False,False,False,False,False,False,False,False,True,False
887,False,False,False,False,False,False,False,False,False,False,False,False
888,False,False,False,False,False,True,False,False,False,False,True,False
889,False,False,False,False,False,False,False,False,False,False,False,False
890,False,False,False,False,False,False,False,False,False,False,True,False

In [53]:
data.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [54]:
round((data.isnull().sum())*100/len(data),2)

PassengerId     0.00
Survived        0.00
Pclass          0.00
Name            0.00
Sex             0.00
Age            19.87
SibSp           0.00
Parch           0.00
Ticket          0.00
Fare            0.00
Cabin          77.10
Embarked        0.22
dtype: float64

###
### Geting Column names

In [55]:
data.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

###
### Droping Columns 
- droping -"name","PassengerID","Ticket"  - because they doest matter for surviving Probablity
- droping - "Cabin" - because it have apx 80% null value..

In [56]:
df = data.drop(["Name","PassengerId","Ticket"],axis=1)
df.drop("Cabin",axis = 1,inplace = True)

###
## fillig  Null values

In [57]:
df["Age"] = df["Age"].fillna(df["Age"].mean())

In [58]:
df.Age.isna().sum()

np.int64(0)

In [59]:
df["Embarked"] = df["Embarked"].fillna(df["Embarked"].mode()[0])

In [60]:
df["Embarked"].isna().sum()

np.int64(0)

###
## Cleaned data

In [61]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 8 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Survived  891 non-null    int64
 1   Pclass    891 non-null    int64
 2   Sex       891 non-null    object
 3   Age       891 non-null    float64
 4   SibSp     891 non-null    int64
 5   Parch     891 non-null    int64
 6   Fare      891 non-null    float64
 7   Embarked  891 non-null    object
dtypes: float64(2), int64(4), object(2)
memory usage: 55.8+ KB

###
# Solving Question by analysis
####


## Question 1 :- How many males and females have survived..

In [132]:
df.groupby("Sex").Survived.mean().mul(100).round(2).reset_index(name= "% of survived")

      Sex  % of survived
0  female          74.20
1    male          18.89

##
## Question 2 :- What is the average Fare for male and female in each class

In [122]:
df.groupby(["Pclass","Sex"]).Fare.mean().round(2).reset_index(name="Avg_Fare")

   Pclass     Sex  Avg_Fare
0       1  female    106.13
1       1    male     67.23
2       2  female     21.97
3       2    male     19.74
4       3  female     16.12
5       3    male     12.66

###
## Question 3 :- What is the average age of survivors vs. non-survivors?

In [73]:
df["Survived label"] = df["Survived"].map({0: "Not Survived", 1: "Survived"})
df.groupby(["Survived label"]).Age.mean().round(2).reset_index(name="Avg Age")

  Survived label  Avg Age
0   Not Survived    30.42
1       Survived    28.55

###
## Question 4 :- Who had a better chance of survival — men or women?

In [79]:
df.groupby("Sex")["Survived"].mean().mul(100).round(2).reset_index(name="Chance of survival")

      Sex  Chance of survival
0  female               74.20
1    male               18.89

###
## Question 5 :- How did passenger class (Pclass) affect survival rate?

In [99]:
df.groupby(["Pclass"]).Survived.mean().mul(100).round(2).reset_index(name="Survival Chances")

   Pclass  Survival Chances
0       1             62.96
1       2             47.28
2       3             24.24

#
### Question 6 :- Did family size and Pclass affect survival?

In [119]:
df["Family_size"] = df["SibSp"] + df["Parch"] + 1
df.groupby(["Pclass","Family_size"])["Survived"].mean().mul(100).round(2).reset_index(name="Survived Rate")

    Pclass  Family_size  Survived Rate
0        1            1          53.21
1        1            2          72.86
2        1            3          75.00
3        1            4          71.43
4        1            5         100.00
5        1            6          50.00
6        2            1          34.62
7        2            2          52.94
8        2            3          67.74
9        2            4          76.92
10       2            5         100.00
11       2            6         100.00
12       3            1          21.30
13       3            2          35.09
14       3            3          42.55
15       3            4          66.67
16       3            5           0.00
17       3            6           0.00
18       3            7          33.33
19       3            8           0.00
20       3           11           0.00

###
### questio 7 :- Did gender + class together affect survival?

In [126]:
df.groupby(["Sex","Pclass"]).Survived.mean().mul(100).round(2).reset_index(name=" % Survived")

      Sex  Pclass   % Survived
0  female       1        96.81
1  female       2        92.11
2  female       3        50.00
3    male       1        36.89
4    male       2        15.74
5    male       3        13.54